# Задание №1
# � Вспомните какие модули вы уже проходили на курсе.
# � Создайте файл, в котором вы импортируете встроенные в
# модуль функции под псевдонимами. (3-7 строк импорта).
# from task001.fist_modal import *

if __name__ == '__main__':
    print('Hello, World!')
