# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.
var1 = 42
var2 = 3.14
var3 = "Hello, World!"
var4 = True

print("Тип var1:", type(var1))
print("Тип var2:", type(var2))
print("Тип var3:", type(var3))
print("Тип var4:", type(var4))
